talk1_webscrapping/slides.org
#+TITLE:     The Art of Webscrapping
#+AUTHOR:    Siddhant Sanyam
#+EMAIL:     siddhant3s@x10n
#+DATE:      2011-09-03 Sat
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 

#+startup: oddeven

#+startup: beamer
#+LaTeX_CLASS: beamer

#+latex_header: \mode<beamer>{\usetheme{Antibes}}
#+latex_header: \documentclass[8pt]{beamer} 
#+BEAMER_FRAME_LEVEL: 2
* Introduction to Web Scrapping
** What is Webscrapping
   Web scrapping simply means automating the process of
   - visiting a website
   - copying the data on some temporary storage (think of a clipboard)
   - pasting it on some spreadsheet program
   - then performing various calculation on it, or simply saving it.
** Some Examples
    - Our college website provides result to individual student by querying their roll number.
    - What if you need the list of all those students who failed in more than 3 subjects?
    - The result of an exam is about to be out on a website, how would you track the website for any changes?
    - Scrap of all the [[http://xkcd.com][xkcd's]] from the website or any other website, which doesn't provide its API
    - Fill up tons of form on a website whose data is stored in an spreadsheet
    - Making offline app interface, or non-interactive terminal program to interact with a website (whose API is not open)
    - There are few real python script related to web scrapping on my Github page
    We'll look into all these examples during the talk.
    
** Why web scrapping
   - Because it saves time.
   - Time is money ;-)
   - Since it is a program, it makes less errors than a typical human
   - Most applications are moving to web, but we still need desktop software
   - It's fun to program a webscraper
** Why Python for webscrapping
   - Less pain full, by nature
   - Language of the internet ~ easy to program internet apps
   - Batteries Included ~ preloaded modules to start scrappying on fly
   - Get's you started instantly
** How will this talk proceed
   - We'll start looking up on each area of Webscrapping, from basic to advanced
   - Not only you would learn about webscrapping but many fundamental concepts of HTTP and how webserver intracts with web browsers
   - Along side, we'll try to do as much examples as possible
   - We'll try to solve real world problems, hence any suggestions are invited
   - Slides sucks, don't rely on them. I'll be demonstrating most of the things on a screen
     session, you can connect with ssh on my computer and see everything in close up.
   - There is a chat server on my PC, you can connect to it, I'll be posting any links or
     similar stuff on it.
   - Remember, doing few things well is better rather than doing many thing sloppily.
* Basics of Webscrapping
** When to Web scrap
   - It depends on various factors, which decides when it is favorable to webscrap 
   - If the scrapper can be developed and can run in the time less than what a human(s) would spend to do the same task
   - When information needed is fairly large and you can't risk for a humane mistake
   And when not to
   - Writing scrappers for a one time task which a human might be able to do in 5 minutes would be a waste of time.
   - When the website have captchas. This means that the website doesn't want you to web scrap
   - When it is written in the TOS not to.
** Elements of webscrapping
   - Fetching or crawling
   - Parsing 
    - Regex 
    - Markup Processor
    - Custom Parsers
   - Analyzing
   - Storing, stateness
   - Posting back

* Fetching
** Fetching source code of a web location
   - UrlOpen
   - Fetching with GET Parameters
   - Fetching with POST Data
   - Adding additional headers
