talk1_webscrapping/slides.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>The Art of Webscrapping</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-03 Sat"/>
<meta name="author" content="Siddhant Sanyam"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">The Art of Webscrapping</h1>



<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2"></span> Introduction to Web Scrapping </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3"></span> What is Webscrapping </h3>
<div class="outline-text-3" id="text-1_1">

<p>   Web scrapping simply means automating the process of
</p><ul>
<li>visiting a website
</li>
<li>copying the data on some temporary storage (think of a clipboard)
</li>
<li>pasting it on some spreadsheet program
</li>
<li>then performing various calculation on it, or simply saving it.
</li>
</ul>

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3"></span> Some Examples </h3>
<div class="outline-text-3" id="text-1_2">

<ul>
<li>Our college website provides result to individual student by querying their roll number.
</li>
<li>What if you need the list of all those students who failed in more than 3 subjects?
</li>
<li>The result of an exam is about to be out on a website, how would you track the website for any changes?
</li>
<li>Scrap of all the <a href="http://xkcd.com">xkcd's</a> from the website or any other website, which doesn't provide its API
</li>
<li>Fill up tons of form on a website whose data is stored in an spreadsheet
</li>
<li>Making offline app interface, or non-interactive terminal program to interact with a website (whose API is not open)
</li>
<li>There are few real python script related to web scrapping on my Github page
</li>
</ul>

<p>    We'll look into all these examples during the talk.
</p>
</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3"><span class="section-number-3"></span> Why web scrapping </h3>
<div class="outline-text-3" id="text-1_3">

<ul>
<li>Because it saves time.
</li>
<li>Time is money ;-)
</li>
<li>Since it is a program, it makes less errors than a typical human
</li>
<li>Most applications are moving to web, but we still need desktop software
</li>
<li>It's fun to program a webscraper
</li>
</ul>

</div>

</div>

<div id="outline-container-1_4" class="outline-3">
<h3 id="sec-1_4"><span class="section-number-3"></span> Why Python for webscrapping </h3>
<div class="outline-text-3" id="text-1_4">

<ul>
<li>Less pain full, by nature
</li>
<li>Language of the internet ~ easy to program internet apps
</li>
<li>Batteries Included ~ preloaded modules to start scrappying on fly
</li>
<li>Get's you started instantly
</li>
</ul>

</div>

</div>

<div id="outline-container-1_5" class="outline-3">
<h3 id="sec-1_5"><span class="section-number-3"></span> How will this talk proceed </h3>
<div class="outline-text-3" id="text-1_5">

<ul>
<li>We'll start looking up on each area of Webscrapping, from basic to advanced
</li>
<li>Not only you would learn about webscrapping but many fundamental concepts of HTTP and how webserver intracts with web browsers
</li>
<li>Along side, we'll try to do as much examples as possible
</li>
<li>We'll try to solve real world problems, hence any suggestions are invited
</li>
<li>Slides sucks, don't rely on them. I'll be demonstrating most of the things on a screen
     session, you can connect with ssh on my computer and see everything in close up.
</li>
<li>There is a chat server on my PC, you can connect to it, I'll be posting any links or
     similar stuff on it.
</li>
<li>Remember, doing few things well is better rather than doing many thing sloppily.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2"></span> Basics of Webscrapping </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3"></span> When to Web scrap </h3>
<div class="outline-text-3" id="text-2_1">

<ul>
<li>It depends on various factors, which decides when it is favorable to webscrap 
</li>
<li>If the scrapper can be developed and can run in the time less than what a human(s) would spend to do the same task
</li>
<li>When information needed is fairly large and you can't risk for a humane mistake
</li>
</ul>

<p>   And when not to
</p><ul>
<li>Writing scrappers for a one time task which a human might be able to do in 5 minutes would be a waste of time.
</li>
<li>When the website have captchas. This means that the website doesn't want you to web scrap
</li>
<li>When it is written in the TOS not to.
</li>
</ul>

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3"></span> Elements of webscrapping </h3>
<div class="outline-text-3" id="text-2_2">

<ul>
<li>Fetching or crawling
</li>
<li>Parsing 
<ul>
<li>Regex 
</li>
<li>Markup Processor
</li>
<li>Custom Parsers
</li>
</ul>

</li>
<li>Analyzing
</li>
<li>Storing, stateness
</li>
<li>Posting back
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2"></span> Fetching </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3"></span> Fetching source code of a web location </h3>
<div class="outline-text-3" id="text-3_1">

<ul>
<li>UrlOpen
</li>
<li>Fetching with GET Parameters
</li>
<li>Fetching with POST Data
</li>
<li>Adding additional headers
</li>
</ul>

</div>

</div>
