talk1_webscrapping/slides.tex
% Created 2011-09-16 Fri 10:22
\documentclass{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\mode<beamer>{\usetheme{Antibes}}
\documentclass[8pt]{beamer} 
\providecommand{\alert}[1]{\textbf{#1}}

\title{The Art of Webscrapping}
\author{Siddhant Sanyam}
\date{2011-09-03 Sat}

\begin{document}

\maketitle




\section{Introduction to Web Scrapping}
\label{sec-1}
\begin{frame}
\frametitle{What is Webscrapping}
\label{sec-1_1}

   Web scrapping simply means automating the process of

\begin{itemize}
\item visiting a website
\item copying the data on some temporary storage (think of a clipboard)
\item pasting it on some spreadsheet program
\item then performing various calculation on it, or simply saving it.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Some Examples}
\label{sec-1_2}


\begin{itemize}
\item Our college website provides result to individual student by querying their roll number.
\item What if you need the list of all those students who failed in more than 3 subjects?
\item The result of an exam is about to be out on a website, how would you track the website for any changes?
\item Scrap of all the \href{http://xkcd.com}{xkcd's} from the website or any other website, which doesn't provide its API
\item Fill up tons of form on a website whose data is stored in an spreadsheet
\item Making offline app interface, or non-interactive terminal program to interact with a website (whose API is not open)
\item There are few real python script related to web scrapping on my Github page
\end{itemize}
    We'll look into all these examples during the talk.
    
\end{frame}
\begin{frame}
\frametitle{Why web scrapping}
\label{sec-1_3}


\begin{itemize}
\item Because it saves time.
\item Time is money ;-)
\item Since it is a program, it makes less errors than a typical human
\item Most applications are moving to web, but we still need desktop software
\item It's fun to program a webscraper
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Why Python for webscrapping}
\label{sec-1_4}


\begin{itemize}
\item Less pain full, by nature
\item Language of the internet \~{} easy to program internet apps
\item Batteries Included \~{} preloaded modules to start scrappying on fly
\item Get's you started instantly
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{How will this talk proceed}
\label{sec-1_5}


\begin{itemize}
\item We'll start looking up on each area of Webscrapping, from basic to advanced
\item Not only you would learn about webscrapping but many fundamental concepts of HTTP and how webserver intracts with web browsers
\item Along side, we'll try to do as much examples as possible
\item We'll try to solve real world problems, hence any suggestions are invited
\item Slides sucks, don't rely on them. I'll be demonstrating most of the things on a screen
     session, you can connect with ssh on my computer and see everything in close up.
\item There is a chat server on my PC, you can connect to it, I'll be posting any links or
     similar stuff on it.
\item Remember, doing few things well is better rather than doing many thing sloppily.
\end{itemize}
\end{frame}
\section{Basics of Webscrapping}
\label{sec-2}
\begin{frame}
\frametitle{When to Web scrap}
\label{sec-2_1}


\begin{itemize}
\item It depends on various factors, which decides when it is favorable to webscrap
\item If the scrapper can be developed and can run in the time less than what a human(s) would spend to do the same task
\item When information needed is fairly large and you can't risk for a humane mistake
\end{itemize}
   And when not to

\begin{itemize}
\item Writing scrappers for a one time task which a human might be able to do in 5 minutes would be a waste of time.
\item When the website have captchas. This means that the website doesn't want you to web scrap
\item When it is written in the TOS not to.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Elements of webscrapping}
\label{sec-2_2}


\begin{itemize}
\item Fetching or crawling
\item Parsing
\begin{itemize}
\item Regex
\item Markup Processor
\item Custom Parsers
\end{itemize}
\item Analyzing
\item Storing, stateness
\item Posting back
\end{itemize}
\end{frame}
\section{Fetching}
\label{sec-3}
\begin{frame}
\frametitle{Fetching source code of a web location}
\label{sec-3_1}


\begin{itemize}
\item UrlOpen
\item Fetching with GET Parameters
\item Fetching with POST Data
\item Adding additional headers
\end{itemize}
\end{frame}
