talk1_webscrapping/slides.org
** urllib a simple module to fetch remote resources
   - Provides a method =urlopen= which can fetch resources from various protocols like http, https(no verification), ftp.
   - Opens up a file-like descriptor which allows reading the remote resource
   - When web scrapping, it is used to fetch the HTML source of the website.
   - Respects proxies.
** Simple use of urllib.urlopen
   #+BEGIN_SRC python
     import urllib
     response_object=urllib.urlopen("http://facebook.com")
     s=response_object.read()
     print s
   #+END_SRC
** Passing GET parameters to urlopen
   - By default the mode is GET, so you just need to append the parameters to the URL string
     
   #+BEGIN_SRC python
          import urllib
          response_object=urllib.urlopen("""
     http://en.wikipedia.org/w/index.php?title=Haar-like_features&oldid=449167022""")
          s=response_object.read()
          print s
   #+END_SRC

** Using urllib.urlencode
   - It allows you to generate your query string based on a dictionary
   - Always use urlencode for encoding URL parameters
   - It automatically takes care of converting spaces into '+', and other symbols to their hex equivalent

   #+BEGIN_SRC python
     params={"title":"Haar-like_features", "oldid":"449167022"}
     encoded_string=urllib.urlencode(params)
     baseurl="http://en.wikipedia.org/w/index.php"
     fullurl=baseurl + "?" + encoded_string
   #+END_SRC
** What about POST?
   - It is as simple as GET
   - Just pass the query string as the second arguement to urlopen
     
   #+BEGIN_SRC python
     query_string=urllib.urlencode({"content":"Paste Content"})
     f=urllib.urlopen("http://dpaste.com/",query_string)
     print f.geturl()
   #+END_SRC
** Checking the end url incase of redirects
   - Webserver might give =301=, =302= or other kind of redirects.
   - urllib take cares of that
   - In case of redirect, use =geturl()= to get the final url

** Example
   - Tracking changes in content of a website.
   - Why would you do that?
    - Well, some important result is coming online. You don't want to mannually refresh the page and check if something has changed
   Let's code it
** Example
   - Making =dpasteme= a simple script to post data on [[http://dpaste.com]]
   - Why would you do that?
     - When you have to paste a log while asking help online, copying from terminal and pasting on browser is not cool
   - Something like
     : cat lspci|grep USB|dpasteme
     : http://dpaste.com/614691/
** That's it for now
   - We'll be covering Fetching resources in much detailed way in the later sections
   - There is a module called urllib2 which allows you handle URL fetching in much advanced ways
   - All that later :)
* Parsing
** Parsing
   - Once you have fetched a remote location, you need to extract useful information out from it
   - Parsing refers to this activity
   - You'll have to parse HTML, XML, JS, JSON etc.
   - Let's see how we can parse the data
** The naive way
   - The naive way is to use =str.find= and slice out the strings.
   - This method is very basic and works on a small domain of strings
   - find, slice, index can be used
   - quick, dirty, not robust
** Using Regex
   - Python have a =re= module
   - It is powerful and can be used for screen scrapping
   - It can be inherently slow since it is regex
   - Although the speed can be improved by compiling the regex
   - I'll show you how it is used in one of my script later.
   
