talk1_webscrapping/slides.html

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3"></span> urllib a simple module to fetch remote resources </h3>
<div class="outline-text-3" id="text-3_2">

<ul>
<li>Provides a method <code>urlopen</code> which can fetch resources from various protocols like http, https(no verification), ftp.
</li>
<li>Opens up a file-like descriptor which allows reading the remote resource
</li>
<li>When web scrapping, it is used to fetch the HTML source of the website.
</li>
<li>Respects proxies.
</li>
</ul>

</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3"></span> Simple use of urllib.urlopen </h3>
<div class="outline-text-3" id="text-3_3">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib
<span style="color: #cdcd00;">response_object</span>=urllib.urlopen(<span style="color: #00cd00;">"http://facebook.com"</span>)
<span style="color: #cdcd00;">s</span>=response_object.read()
<span style="color: #00cdcd; font-weight: bold;">print</span> s
</pre>


</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3"></span> Passing GET parameters to urlopen </h3>
<div class="outline-text-3" id="text-3_4">

<ul>
<li>By default the mode is GET, so you just need to append the parameters to the URL string




<pre class="src src-python">     <span style="color: #00cdcd; font-weight: bold;">import</span> urllib
     response_object=urllib.urlopen(<span style="color: #00cd00;">"""
http://en.wikipedia.org/w/index.php?title=Haar-like_features&amp;oldid=449167022"""</span>)
     s=response_object.read()
     <span style="color: #00cdcd; font-weight: bold;">print</span> s
</pre>


</li>
</ul>


</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3"></span> Using urllib.urlencode </h3>
<div class="outline-text-3" id="text-3_5">

<ul>
<li>It allows you to generate your query string based on a dictionary
</li>
<li>Always use urlencode for encoding URL parameters
</li>
<li>It automatically takes care of converting spaces into '+', and other symbols to their hex equivalent




<pre class="src src-python"><span style="color: #cdcd00;">params</span>={<span style="color: #00cd00;">"title"</span>:<span style="color: #00cd00;">"Haar-like_features"</span>, <span style="color: #00cd00;">"oldid"</span>:<span style="color: #00cd00;">"449167022"</span>}
<span style="color: #cdcd00;">encoded_string</span>=urllib.urlencode(params)
<span style="color: #cdcd00;">baseurl</span>=<span style="color: #00cd00;">"http://en.wikipedia.org/w/index.php"</span>
<span style="color: #cdcd00;">fullurl</span>=baseurl + <span style="color: #00cd00;">"?"</span> + encoded_string
</pre>


</li>
</ul>

</div>

</div>

<div id="outline-container-3_6" class="outline-3">
<h3 id="sec-3_6"><span class="section-number-3"></span> What about POST? </h3>
<div class="outline-text-3" id="text-3_6">

<ul>
<li>It is as simple as GET
</li>
<li>Just pass the query string as the second arguement to urlopen




<pre class="src src-python"><span style="color: #cdcd00;">query_string</span>=urllib.urlencode({<span style="color: #00cd00;">"content"</span>:<span style="color: #00cd00;">"Paste Content"</span>})
<span style="color: #cdcd00;">f</span>=urllib.urlopen(<span style="color: #00cd00;">"http://dpaste.com/"</span>,query_string)
<span style="color: #00cdcd; font-weight: bold;">print</span> f.geturl()
</pre>


</li>
</ul>

</div>

</div>

<div id="outline-container-3_7" class="outline-3">
<h3 id="sec-3_7"><span class="section-number-3"></span> Checking the end url incase of redirects </h3>
<div class="outline-text-3" id="text-3_7">

<ul>
<li>Webserver might give <code>301</code>, <code>302</code> or other kind of redirects.
</li>
<li>urllib take cares of that
</li>
<li>In case of redirect, use <code>geturl()</code> to get the final url
</li>
</ul>


</div>

</div>

<div id="outline-container-3_8" class="outline-3">
<h3 id="sec-3_8"><span class="section-number-3"></span> Example </h3>
<div class="outline-text-3" id="text-3_8">

<ul>
<li>Tracking changes in content of a website.
</li>
<li>Why would you do that?
<ul>
<li>Well, some important result is coming online. You don't want to mannually refresh the page and check if something has changed
</li>
</ul>

</li>
</ul>

<p>   Let's code it
</p></div>

</div>

<div id="outline-container-3_9" class="outline-3">
<h3 id="sec-3_9"><span class="section-number-3"></span> Example </h3>
<div class="outline-text-3" id="text-3_9">

<ul>
<li>Making <code>dpasteme</code> a simple script to post data on <a href="http://dpaste.com">http://dpaste.com</a>
</li>
<li>Why would you do that?
<ul>
<li>When you have to paste a log while asking help online, copying from terminal and pasting on browser is not cool
</li>
</ul>

</li>
<li>Something like
<pre class="example">
cat lspci|grep USB|dpasteme
http://dpaste.com/614691/
</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-3_10" class="outline-3">
<h3 id="sec-3_10"><span class="section-number-3"></span> That's it for now </h3>
<div class="outline-text-3" id="text-3_10">

<ul>
<li>We'll be covering Fetching resources in much detailed way in the later sections
</li>
<li>There is a module called urllib2 which allows you handle URL fetching in much advanced ways
</li>
<li>All that later :)
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2"></span> Parsing </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3"></span> Parsing </h3>
<div class="outline-text-3" id="text-4_1">

<ul>
<li>Once you have fetched a remote location, you need to extract useful information out from it
</li>
<li>Parsing refers to this activity
</li>
<li>You'll have to parse HTML, XML, JS, JSON etc.
</li>
<li>Let's see how we can parse the data
</li>
</ul>

</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3"></span> The naive way </h3>
<div class="outline-text-3" id="text-4_2">

<ul>
<li>The naive way is to use <code>str.find</code> and slice out the strings.
</li>
<li>This method is very basic and works on a small domain of strings
</li>
<li>find, slice, index can be used
</li>
<li>quick, dirty, not robust
</li>
</ul>

</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3"></span> Using Regex </h3>
<div class="outline-text-3" id="text-4_3">

<ul>
<li>Python have a <code>re</code> module
</li>
<li>It is powerful and can be used for screen scrapping
</li>
<li>It can be inherently slow since it is regex
</li>
<li>Although the speed can be improved by compiling the regex
</li>
<li>I'll show you how it is used in one of my script later.
</li>
</ul>


</div>

</div>
