talk1_webscrapping/slides.tex
\begin{frame}
\frametitle{urllib a simple module to fetch remote resources}
\label{sec-3_2}


\begin{itemize}
\item Provides a method \texttt{urlopen} which can fetch resources from various protocols like http, https(no verification), ftp.
\item Opens up a file-like descriptor which allows reading the remote resource
\item When web scrapping, it is used to fetch the HTML source of the website.
\item Respects proxies.
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Simple use of urllib.urlopen}
\label{sec-3_3}

\begin{verbatim}
import urllib
response_object=urllib.urlopen("http://facebook.com")
s=response_object.read()
print s
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Passing GET parameters to urlopen}
\label{sec-3_4}


\begin{itemize}
\item By default the mode is GET, so you just need to append the parameters to the URL string
     
\begin{verbatim}
     import urllib
     response_object=urllib.urlopen("""
http://en.wikipedia.org/w/index.php?title=Haar-like_features&oldid=449167022""")
     s=response_object.read()
     print s
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Using urllib.urlencode}
\label{sec-3_5}


\begin{itemize}
\item It allows you to generate your query string based on a dictionary
\item Always use urlencode for encoding URL parameters
\item It automatically takes care of converting spaces into `+', and other symbols to their hex equivalent

\begin{verbatim}
params={"title":"Haar-like_features", "oldid":"449167022"}
encoded_string=urllib.urlencode(params)
baseurl="http://en.wikipedia.org/w/index.php"
fullurl=baseurl + "?" + encoded_string
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{What about POST?}
\label{sec-3_6}


\begin{itemize}
\item It is as simple as GET
\item Just pass the query string as the second arguement to urlopen
     
\begin{verbatim}
query_string=urllib.urlencode({"content":"Paste Content"})
f=urllib.urlopen("http://dpaste.com/",query_string)
print f.geturl()
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Checking the end url incase of redirects}
\label{sec-3_7}


\begin{itemize}
\item Webserver might give \texttt{301}, \texttt{302} or other kind of redirects.
\item urllib take cares of that
\item In case of redirect, use \texttt{geturl()} to get the final url
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Example}
\label{sec-3_8}


\begin{itemize}
\item Tracking changes in content of a website.
\item Why would you do that?
\begin{itemize}
\item Well, some important result is coming online. You don't want to mannually refresh the page and check if something has changed
\end{itemize}
\end{itemize}
   Let's code it
\end{frame}
\begin{frame}[fragile]
\frametitle{Example}
\label{sec-3_9}


\begin{itemize}
\item Making \texttt{dpasteme} a simple script to post data on \href{http://dpaste.com}{http://dpaste.com}
\item Why would you do that?
\begin{itemize}
\item When you have to paste a log while asking help online, copying from terminal and pasting on browser is not cool
\end{itemize}
\item Something like
\begin{verbatim}
      cat lspci|grep USB|dpasteme
      http://dpaste.com/614691/
\end{verbatim}

\end{itemize}
\end{frame}
\begin{frame}
\frametitle{That's it for now}
\label{sec-3_10}


\begin{itemize}
\item We'll be covering Fetching resources in much detailed way in the later sections
\item There is a module called urllib2 which allows you handle URL fetching in much advanced ways
\item All that later :)
\end{itemize}
\end{frame}
\section{Parsing}
\label{sec-4}
\begin{frame}
\frametitle{Parsing}
\label{sec-4_1}


\begin{itemize}
\item Once you have fetched a remote location, you need to extract useful information out from it
\item Parsing refers to this activity
\item You'll have to parse HTML, XML, JS, JSON etc.
\item Let's see how we can parse the data
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{The naive way}
\label{sec-4_2}


\begin{itemize}
\item The naive way is to use \texttt{str.find} and slice out the strings.
\item This method is very basic and works on a small domain of strings
\item find, slice, index can be used
\item quick, dirty, not robust
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Using Regex}
\label{sec-4_3}


\begin{itemize}
\item Python have a \texttt{re} module
\item It is powerful and can be used for screen scrapping
\item It can be inherently slow since it is regex
\item Although the speed can be improved by compiling the regex
\item I'll show you how it is used in one of my script later.
\end{itemize}
   
\end{frame}
