talk1_webscrapping/slides.org
** Dedicated Marker Parsers
   - The good news - most of the web is HTML
   - By nature, HTML is easier to parse, because it is structured.
   - Hence you can use some of the dedicated parsers available
   - Python comes with HTML, JSON, XML parsers etc.
   - Most of the time in Web scrapping, you'll be using HTML parsers to parse the source code
** Custom Parsers
   - There might be instances when you'll have to write your custom parsers
   - These parsers, along with the prebuilt parsers can offer great deal of flexibility
   - If you write these parsers, please publish it open source online so that we can use them too
** Enter BeautifulSoup
   - It is an HTML markup
   - It handles bad markup easily
   - Handles encoding by converting them to UTF-8
   - It is Beautiful, seriously, you'll feel it when you use it
** Using Beautiful Soup
   - Filling the Soup
   - Basic HTML traversal
   - find, findAll
   - Pretty Print
   - Unicode trouble
** Filling the soup
   #+BEGIN_SRC python
     from BeautifulSoup import BeautifulSoup
     html="""
     <html><head><title>SimplePage</title></head>
     <body>
     <pre> Simple Body </pre>
     </body>
     </html>"""
     soup = BeautifulSoup(html)
     print soup.prettify()
     
   #+END_SRC 
** Filling Soup with urllib.urlopen
   #+BEGIN_SRC python     import urllib
     from BeautifulSoup import BeautifulSoup as BS
     import urllib
     resp = urllib.urlopen("http://facebook.com")
     soup = BS(resp)
     print soup.prettify()
   #+END_SRC
** Using BeautifulSoup
   We'll check usage by demonstration

** Example
  Fetching results of list of student from a University website
  - Why would you that?
    - Because you want to know the list of all those students who got an 'F' in the same subject you got 'F'.
   
* Crawling
** Crawling
   - Crawling basically means using links scrapped from one page as the target for the next scrap
   - Examples
     - Generating a dependency tree of ArchLinux using the online database
     - Downloading Manga from mangareader.net
     - Whenever links have some hash value which is not determinable.
** When should you crawl
   - Whenever you have to
   - Crawling means more HTTP requests
   - More time spend on the network hence slow script
   - Golden Rule: Avoid crawling
* urlretrieve
** Before the next example, urllretrieve
   - urlopen is a fine method to fetch resources like HTML, JS, JSON
   - Many times you need to download files like Images, Videos, or Binaries
   - You have no interest in parsing these files
   - urlretrieve is a better option
** Why urlretrieve
   - It is a function made to ease out downloading of files
   - Oversimplified wget
   - Allows you to track your download
   - Let's take an example to clear things up
* Examples
** Example of simple usage of urlretrieve
   #+BEGIN_SRC python
     import urllib
     urllib.urlretrieve("http://festember.in/11/images/bartending.jpg","spam.jpg")
     
   #+END_SRC
