talk1_webscrapping/slides.html

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3"></span> Dedicated Marker Parsers </h3>
<div class="outline-text-3" id="text-4_4">

<ul>
<li>The good news - most of the web is HTML
</li>
<li>By nature, HTML is easier to parse, because it is structured.
</li>
<li>Hence you can use some of the dedicated parsers available
</li>
<li>Python comes with HTML, JSON, XML parsers etc.
</li>
<li>Most of the time in Web scrapping, you'll be using HTML parsers to parse the source code
</li>
</ul>

</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3"></span> Custom Parsers </h3>
<div class="outline-text-3" id="text-4_5">

<ul>
<li>There might be instances when you'll have to write your custom parsers
</li>
<li>These parsers, along with the prebuilt parsers can offer great deal of flexibility
</li>
<li>If you write these parsers, please publish it open source online so that we can use them too
</li>
</ul>

</div>

</div>

<div id="outline-container-4_6" class="outline-3">
<h3 id="sec-4_6"><span class="section-number-3"></span> Enter BeautifulSoup </h3>
<div class="outline-text-3" id="text-4_6">

<ul>
<li>It is an HTML markup
</li>
<li>It handles bad markup easily
</li>
<li>Handles encoding by converting them to UTF-8
</li>
<li>It is Beautiful, seriously, you'll feel it when you use it
</li>
</ul>

</div>

</div>

<div id="outline-container-4_7" class="outline-3">
<h3 id="sec-4_7"><span class="section-number-3"></span> Using Beautiful Soup </h3>
<div class="outline-text-3" id="text-4_7">

<ul>
<li>Filling the Soup
</li>
<li>Basic HTML traversal
</li>
<li>find, findAll
</li>
<li>Pretty Print
</li>
<li>Unicode trouble
</li>
</ul>

</div>

</div>

<div id="outline-container-4_8" class="outline-3">
<h3 id="sec-4_8"><span class="section-number-3"></span> Filling the soup </h3>
<div class="outline-text-3" id="text-4_8">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">from</span> BeautifulSoup <span style="color: #00cdcd; font-weight: bold;">import</span> BeautifulSoup
<span style="color: #cdcd00;">html</span>=<span style="color: #00cd00;">"""
&lt;html&gt;&lt;head&gt;&lt;title&gt;SimplePage&lt;/title&gt;&lt;/head&gt;
&lt;body&gt;
&lt;pre&gt; Simple Body &lt;/pre&gt;
&lt;/body&gt;
&lt;/html&gt;"""</span>
<span style="color: #cdcd00;">soup</span> = BeautifulSoup(html)
<span style="color: #00cdcd; font-weight: bold;">print</span> soup.prettify()

</pre>


</div>

</div>

<div id="outline-container-4_9" class="outline-3">
<h3 id="sec-4_9"><span class="section-number-3"></span> Filling Soup with urllib.urlopen </h3>
<div class="outline-text-3" id="text-4_9">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">from</span> BeautifulSoup <span style="color: #00cdcd; font-weight: bold;">import</span> BeautifulSoup <span style="color: #00cdcd; font-weight: bold;">as</span> BS
<span style="color: #00cdcd; font-weight: bold;">import</span> urllib
<span style="color: #cdcd00;">resp</span> = urllib.urlopen(<span style="color: #00cd00;">"http://facebook.com"</span>)
<span style="color: #cdcd00;">soup</span> = BS(resp)
<span style="color: #00cdcd; font-weight: bold;">print</span> soup.prettify()
</pre>


</div>

</div>

<div id="outline-container-4_10" class="outline-3">
<h3 id="sec-4_10"><span class="section-number-3"></span> Using BeautifulSoup </h3>
<div class="outline-text-3" id="text-4_10">

<p>   We'll check usage by demonstration
</p>
</div>

</div>

<div id="outline-container-4_11" class="outline-3">
<h3 id="sec-4_11"><span class="section-number-3"></span> Example </h3>
<div class="outline-text-3" id="text-4_11">

<p>  Fetching results of list of student from a University website
</p><ul>
<li>Why would you that?
<ul>
<li>Because you want to know the list of all those students who got an 'F' in the same subject you got 'F'.
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2"></span> Crawling </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3"></span> Crawling </h3>
<div class="outline-text-3" id="text-5_1">

<ul>
<li>Crawling basically means using links scrapped from one page as the target for the next scrap
</li>
<li>Examples
<ul>
<li>Generating a dependency tree of ArchLinux using the online database
</li>
<li>Downloading Manga from mangareader.net
</li>
<li>Whenever links have some hash value which is not determinable.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3"></span> When should you crawl </h3>
<div class="outline-text-3" id="text-5_2">

<ul>
<li>Whenever you have to
</li>
<li>Crawling means more HTTP requests
</li>
<li>More time spend on the network hence slow script
</li>
<li>Golden Rule: Avoid crawling
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2"></span> urlretrieve </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3"></span> Before the next example, urllretrieve </h3>
<div class="outline-text-3" id="text-6_1">

<ul>
<li>urlopen is a fine method to fetch resources like HTML, JS, JSON
</li>
<li>Many times you need to download files like Images, Videos, or Binaries
</li>
<li>You have no interest in parsing these files
</li>
<li>urlretrieve is a better option
</li>
</ul>

</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3"></span> Why urlretrieve </h3>
<div class="outline-text-3" id="text-6_2">

<ul>
<li>It is a function made to ease out downloading of files
</li>
<li>Oversimplified wget
</li>
<li>Allows you to track your download
</li>
<li>Let's take an example to clear things up
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2"></span> Examples </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3"></span> Example of simple usage of urlretrieve </h3>
<div class="outline-text-3" id="text-7_1">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib
urllib.urlretrieve(<span style="color: #00cd00;">"http://festember.in/11/images/bartending.jpg"</span>,<span style="color: #00cd00;">"spam.jpg"</span>)

</pre>


</div>

</div>
