talk1_webscrapping/slides.tex
\begin{frame}
\frametitle{Dedicated Marker Parsers}
\label{sec-4_4}


\begin{itemize}
\item The good news - most of the web is HTML
\item By nature, HTML is easier to parse, because it is structured.
\item Hence you can use some of the dedicated parsers available
\item Python comes with HTML, JSON, XML parsers etc.
\item Most of the time in Web scrapping, you'll be using HTML parsers to parse the source code
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Custom Parsers}
\label{sec-4_5}


\begin{itemize}
\item There might be instances when you'll have to write your custom parsers
\item These parsers, along with the prebuilt parsers can offer great deal of flexibility
\item If you write these parsers, please publish it open source online so that we can use them too
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Enter BeautifulSoup}
\label{sec-4_6}


\begin{itemize}
\item It is an HTML markup
\item It handles bad markup easily
\item Handles encoding by converting them to UTF-8
\item It is Beautiful, seriously, you'll feel it when you use it
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Using Beautiful Soup}
\label{sec-4_7}


\begin{itemize}
\item Filling the Soup
\item Basic HTML traversal
\item find, findAll
\item Pretty Print
\item Unicode trouble
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Filling the soup}
\label{sec-4_8}

\begin{verbatim}
from BeautifulSoup import BeautifulSoup
html="""
<html><head><title>SimplePage</title></head>
<body>
<pre> Simple Body </pre>
</body>
</html>"""
soup = BeautifulSoup(html)
print soup.prettify()
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Filling Soup with urllib.urlopen}
\label{sec-4_9}

\begin{verbatim}
from BeautifulSoup import BeautifulSoup as BS
import urllib
resp = urllib.urlopen("http://facebook.com")
soup = BS(resp)
print soup.prettify()
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Using BeautifulSoup}
\label{sec-4_10}

   We'll check usage by demonstration
\end{frame}
\begin{frame}
\frametitle{Example}
\label{sec-4_11}

  Fetching results of list of student from a University website

\begin{itemize}
\item Why would you that?
\begin{itemize}
\item Because you want to know the list of all those students who got an `F' in the same subject you got `F'.
\end{itemize}
\end{itemize}
   
\end{frame}
\section{Crawling}
\label{sec-5}
\begin{frame}
\frametitle{Crawling}
\label{sec-5_1}


\begin{itemize}
\item Crawling basically means using links scrapped from one page as the target for the next scrap
\item Examples
\begin{itemize}
\item Generating a dependency tree of ArchLinux using the online database
\item Downloading Manga from mangareader.net
\item Whenever links have some hash value which is not determinable.
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{When should you crawl}
\label{sec-5_2}


\begin{itemize}
\item Whenever you have to
\item Crawling means more HTTP requests
\item More time spend on the network hence slow script
\item Golden Rule: Avoid crawling
\end{itemize}
\end{frame}
\section{urlretrieve}
\label{sec-6}
\begin{frame}
\frametitle{Before the next example, urllretrieve}
\label{sec-6_1}


\begin{itemize}
\item urlopen is a fine method to fetch resources like HTML, JS, JSON
\item Many times you need to download files like Images, Videos, or Binaries
\item You have no interest in parsing these files
\item urlretrieve is a better option
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Why urlretrieve}
\label{sec-6_2}


\begin{itemize}
\item It is a function made to ease out downloading of files
\item Oversimplified wget
\item Allows you to track your download
\item Let's take an example to clear things up
\end{itemize}
\end{frame}
\section{Examples}
\label{sec-7}
\begin{frame}[fragile]
\frametitle{Example of simple usage of urlretrieve}
\label{sec-7_1}

\begin{verbatim}
import urllib
urllib.urlretrieve("http://festember.in/11/images/bartending.jpg","spam.jpg")
\end{verbatim}
\end{frame}
