talk1_webscrapping/slides.org
** Example of urlretrieve with progress bar
   #+BEGIN_SRC python
     def progress_printer(transferred,block_size,total_size):
         """Prints a progress bar. transferred is the number of block transferred.
         block_size is the size of each block. total_size is the total size of
         the file."""
         speed=0
         try:
             speed=float(block_size)/speedtimer.next()/1000
         except ZeroDivisionError:
             pass
         completed=transferred*block_size
         percent=(completed*100)/total_size
         sys.stdout.write("\r%.2f%% complete[%d/%d bytes] @ %.2f KBytes/sec"% \
                          (percent,completed,total_size,speed))
         sys.stdout.flush()
         
     urllib.urlretrieve("http://festember.in/11/images/bartending.jpg","spam.jpg", progress_printer)
     
   #+END_SRC
** Example xkcd
  Fetching the latest xkcd comic automatically. Given a range
  - Why would you do that?
    - Because everyone enjoy reading xkcd. For slow internet connection it is best to keep a local copy
  Let's hack this

** A slightly advanced example: downloading mangas
   - Fetching some manga for offline reading: onemangadl
   - [[http://github.com/siddhant3s/onemangadl]]
   - It downloads mangas (to oversimplify, it's a Japanese comic book)
   - Why would you do that?
     - Because I like reading manga's 
     - It's an awesome example for web scrapping
   - Let's make this

* urllib2
** Before the next section, urllib2
   - Allows fetching of remote resources with advance mechanisms
   - Helps in simulating a real web browser
   - Allows, cookies, authentication, persistence, custom headers etc.
** Some concepts related to urllib2
   - Works on request, response model
   - Make a =request= model
   - Pass it to urllib2
   - Do stuff on the =response= object you received
** urlopen
   - Also has a urlopen
   - Works same way as urllib's urlopen
   - Can handle the =request= object
     
    #+BEGIN_SRC python
      import urllib2
      response = urllib2.urlopen('http://facebook.com/')
      html = response.read()
    #+END_SRC
** A simple request object
   - This object mimics an actual HTTP request
     #+BEGIN_SRC python
       import urllib2
       
       req = urllib2.Request('http://facebook.com')
       response = urllib2.urlopen(req)
       the_page = response.read()
     #+END_SRC 
   - At a simplest level, request object can be supplied with just the URL of the location
** Again, the data?
   - Sending GET data is same as appending the query string (remember =urllib.urlencode= ?)
   - Sending POST data is also simple
     #+BEGIN_SRC python
       import urllib, urllib2
       query_string=urllib.urlencode({"content":"Paste Content"})
       
       req = urllib2.Request(url, query_string)
       response = urllib2.urlopen(req)
       the_page = response.read()
       
     #+END_SRC
** The Fun part, adding Headers
   - Many times you need to add additional HTTP headers to your requests
   - Like =User Agent=, for convincing web server that you are a browser
   - This is the single most powerful feature of urllib2
** Adding HTTP headers
   #+BEGIN_SRC python
     import urllib
     import urllib2
     
     url = 'http://localhost/~siddhant3s/phpinfo.php'
     user_agent = 'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'
     values = {'name' : 'Siddhant Sanyam',
               'age' : '20'}
     
     headers = { 'User-Agent' : user_agent }
     
     data = urllib.urlencode(values)
     req = urllib2.Request(url, data, headers)
     response = urllib2.urlopen(req)
     the_page = response.read()
     s=the_page[the_page.find("User-Agent "):]
     print s[:100] #Check our script
     
   #+END_SRC
