talk1_webscrapping/slides.html

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3"></span> Example of urlretrieve with progress bar </h3>
<div class="outline-text-3" id="text-7_2">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">def</span> <span style="color: #0000ee; font-weight: bold;">progress_printer</span>(transferred,block_size,total_size):
    <span style="color: #00cd00;">"""Prints a progress bar. transferred is the number of block transferred.
    block_size is the size of each block. total_size is the total size of
    the file."""</span>
    speed=0
    <span style="color: #00cdcd; font-weight: bold;">try</span>:
        speed=<span style="color: #0000ee; font-weight: bold;">float</span>(block_size)/speedtimer.next()/1000
    <span style="color: #00cdcd; font-weight: bold;">except</span> <span style="color: #00cd00;">ZeroDivisionError</span>:
        <span style="color: #00cdcd; font-weight: bold;">pass</span>
    completed=transferred*block_size
    percent=(completed*100)/total_size
    sys.stdout.write(<span style="color: #00cd00;">"\r%.2f%% complete[%d/%d bytes] @ %.2f KBytes/sec"</span>% \
                     (percent,completed,total_size,speed))
    sys.stdout.flush()
    
urllib.urlretrieve(<span style="color: #00cd00;">"http://festember.in/11/images/bartending.jpg"</span>,<span style="color: #00cd00;">"spam.jpg"</span>, progress_printer)

</pre>


</div>

</div>

<div id="outline-container-7_3" class="outline-3">
<h3 id="sec-7_3"><span class="section-number-3"></span> Example xkcd </h3>
<div class="outline-text-3" id="text-7_3">

<p>  Fetching the latest xkcd comic automatically. Given a range
</p><ul>
<li>Why would you do that?
<ul>
<li>Because everyone enjoy reading xkcd. For slow internet connection it is best to keep a local copy
</li>
</ul>

</li>
</ul>

<p>  Let's hack this
</p>
</div>

</div>

<div id="outline-container-7_4" class="outline-3">
<h3 id="sec-7_4"><span class="section-number-3"></span> A slightly advanced example: downloading mangas </h3>
<div class="outline-text-3" id="text-7_4">

<ul>
<li>Fetching some manga for offline reading: onemangadl
</li>
<li><a href="http://github.com/siddhant3s/onemangadl">http://github.com/siddhant3s/onemangadl</a>
</li>
<li>It downloads mangas (to oversimplify, it's a Japanese comic book)
</li>
<li>Why would you do that?
<ul>
<li>Because I like reading manga's 
</li>
<li>It's an awesome example for web scrapping
</li>
</ul>

</li>
<li>Let's make this
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2"></span> urllib2 </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3"></span> Before the next section, urllib2 </h3>
<div class="outline-text-3" id="text-8_1">

<ul>
<li>Allows fetching of remote resources with advance mechanisms
</li>
<li>Helps in simulating a real web browser
</li>
<li>Allows, cookies, authentication, persistence, custom headers etc.
</li>
</ul>

</div>

</div>

<div id="outline-container-8_2" class="outline-3">
<h3 id="sec-8_2"><span class="section-number-3"></span> Some concepts related to urllib2 </h3>
<div class="outline-text-3" id="text-8_2">

<ul>
<li>Works on request, response model
</li>
<li>Make a <code>request</code> model
</li>
<li>Pass it to urllib2
</li>
<li>Do stuff on the <code>response</code> object you received
</li>
</ul>

</div>

</div>

<div id="outline-container-8_3" class="outline-3">
<h3 id="sec-8_3"><span class="section-number-3"></span> urlopen </h3>
<div class="outline-text-3" id="text-8_3">

<ul>
<li>Also has a urlopen
</li>
<li>Works same way as urllib's urlopen
</li>
<li>Can handle the <code>request</code> object




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib2
<span style="color: #cdcd00;">response</span> = urllib2.urlopen(<span style="color: #00cd00;">'http://facebook.com/'</span>)
<span style="color: #cdcd00;">html</span> = response.read()
</pre>


</li>
</ul>

</div>

</div>

<div id="outline-container-8_4" class="outline-3">
<h3 id="sec-8_4"><span class="section-number-3"></span> A simple request object </h3>
<div class="outline-text-3" id="text-8_4">

<ul>
<li>This object mimics an actual HTTP request



<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib2

<span style="color: #cdcd00;">req</span> = urllib2.Request(<span style="color: #00cd00;">'http://facebook.com'</span>)
<span style="color: #cdcd00;">response</span> = urllib2.urlopen(req)
<span style="color: #cdcd00;">the_page</span> = response.read()
</pre>


</li>
<li>At a simplest level, request object can be supplied with just the URL of the location
</li>
</ul>

</div>

</div>

<div id="outline-container-8_5" class="outline-3">
<h3 id="sec-8_5"><span class="section-number-3"></span> Again, the data? </h3>
<div class="outline-text-3" id="text-8_5">

<ul>
<li>Sending GET data is same as appending the query string (remember <code>urllib.urlencode</code> ?)
</li>
<li>Sending POST data is also simple



<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib, urllib2
<span style="color: #cdcd00;">query_string</span>=urllib.urlencode({<span style="color: #00cd00;">"content"</span>:<span style="color: #00cd00;">"Paste Content"</span>})

<span style="color: #cdcd00;">req</span> = urllib2.Request(url, query_string)
<span style="color: #cdcd00;">response</span> = urllib2.urlopen(req)
<span style="color: #cdcd00;">the_page</span> = response.read()

</pre>


</li>
</ul>

</div>

</div>

<div id="outline-container-8_6" class="outline-3">
<h3 id="sec-8_6"><span class="section-number-3"></span> The Fun part, adding Headers </h3>
<div class="outline-text-3" id="text-8_6">

<ul>
<li>Many times you need to add additional HTTP headers to your requests
</li>
<li>Like <code>User Agent</code>, for convincing web server that you are a browser
</li>
<li>This is the single most powerful feature of urllib2
</li>
</ul>

</div>

</div>

<div id="outline-container-8_7" class="outline-3">
<h3 id="sec-8_7"><span class="section-number-3"></span> Adding HTTP headers </h3>
<div class="outline-text-3" id="text-8_7">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib
<span style="color: #00cdcd; font-weight: bold;">import</span> urllib2

<span style="color: #cdcd00;">url</span> = <span style="color: #00cd00;">'http://localhost/~siddhant3s/phpinfo.php'</span>
<span style="color: #cdcd00;">user_agent</span> = <span style="color: #00cd00;">'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'</span>
<span style="color: #cdcd00;">values</span> = {<span style="color: #00cd00;">'name'</span> : <span style="color: #00cd00;">'Siddhant Sanyam'</span>,
          <span style="color: #00cd00;">'age'</span> : <span style="color: #00cd00;">'20'</span>}

<span style="color: #cdcd00;">headers</span> = { <span style="color: #00cd00;">'User-Agent'</span> : user_agent }

<span style="color: #cdcd00;">data</span> = urllib.urlencode(values)
<span style="color: #cdcd00;">req</span> = urllib2.Request(url, data, headers)
<span style="color: #cdcd00;">response</span> = urllib2.urlopen(req)
<span style="color: #cdcd00;">the_page</span> = response.read()
<span style="color: #cdcd00;">s</span>=the_page[the_page.find(<span style="color: #00cd00;">"User-Agent "</span>):]
<span style="color: #00cdcd; font-weight: bold;">print</span> s[:100] #Check our script

</pre>


</div>

</div>
