talk1_webscrapping/slides.tex
\begin{frame}[fragile]
\frametitle{Example of urlretrieve with progress bar}
\label{sec-7_2}

\begin{verbatim}
def progress_printer(transferred,block_size,total_size):
    """Prints a progress bar. transferred is the number of block transferred.
    block_size is the size of each block. total_size is the total size of
    the file."""
    speed=0
    try:
        speed=float(block_size)/speedtimer.next()/1000
    except ZeroDivisionError:
        pass
    completed=transferred*block_size
    percent=(completed*100)/total_size
    sys.stdout.write("\r%.2f%% complete[%d/%d bytes] @ %.2f KBytes/sec"% \
                     (percent,completed,total_size,speed))
    sys.stdout.flush()
    
urllib.urlretrieve("http://festember.in/11/images/bartending.jpg","spam.jpg", progress_printer)
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Example xkcd}
\label{sec-7_3}

  Fetching the latest xkcd comic automatically. Given a range

\begin{itemize}
\item Why would you do that?
\begin{itemize}
\item Because everyone enjoy reading xkcd. For slow internet connection it is best to keep a local copy
\end{itemize}
\end{itemize}
  Let's hack this
\end{frame}
\begin{frame}
\frametitle{A slightly advanced example: downloading mangas}
\label{sec-7_4}


\begin{itemize}
\item Fetching some manga for offline reading: onemangadl
\item \href{http://github.com/siddhant3s/onemangadl}{http://github.com/siddhant3s/onemangadl}
\item It downloads mangas (to oversimplify, it's a Japanese comic book)
\item Why would you do that?
\begin{itemize}
\item Because I like reading manga's
\item It's an awesome example for web scrapping
\end{itemize}
\item Let's make this
\end{itemize}
\end{frame}
\section{urllib2}
\label{sec-8}
\begin{frame}
\frametitle{Before the next section, urllib2}
\label{sec-8_1}


\begin{itemize}
\item Allows fetching of remote resources with advance mechanisms
\item Helps in simulating a real web browser
\item Allows, cookies, authentication, persistence, custom headers etc.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Some concepts related to urllib2}
\label{sec-8_2}


\begin{itemize}
\item Works on request, response model
\item Make a \texttt{request} model
\item Pass it to urllib2
\item Do stuff on the \texttt{response} object you received
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{urlopen}
\label{sec-8_3}


\begin{itemize}
\item Also has a urlopen
\item Works same way as urllib's urlopen
\item Can handle the \texttt{request} object
     
\begin{verbatim}
import urllib2
response = urllib2.urlopen('http://facebook.com/')
html = response.read()
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{A simple request object}
\label{sec-8_4}


\begin{itemize}
\item This object mimics an actual HTTP request
\begin{verbatim}
import urllib2

req = urllib2.Request('http://facebook.com')
response = urllib2.urlopen(req)
the_page = response.read()
\end{verbatim}
\item At a simplest level, request object can be supplied with just the URL of the location
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Again, the data?}
\label{sec-8_5}


\begin{itemize}
\item Sending GET data is same as appending the query string (remember \texttt{urllib.urlencode} ?)
\item Sending POST data is also simple
\begin{verbatim}
import urllib, urllib2
query_string=urllib.urlencode({"content":"Paste Content"})

req = urllib2.Request(url, query_string)
response = urllib2.urlopen(req)
the_page = response.read()
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{The Fun part, adding Headers}
\label{sec-8_6}


\begin{itemize}
\item Many times you need to add additional HTTP headers to your requests
\item Like \texttt{User Agent}, for convincing web server that you are a browser
\item This is the single most powerful feature of urllib2
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Adding HTTP headers}
\label{sec-8_7}

\begin{verbatim}
import urllib
import urllib2

url = 'http://localhost/~siddhant3s/phpinfo.php'
user_agent = 'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'
values = {'name' : 'Siddhant Sanyam',
          'age' : '20'}

headers = { 'User-Agent' : user_agent }

data = urllib.urlencode(values)
req = urllib2.Request(url, data, headers)
response = urllib2.urlopen(req)
the_page = response.read()
s=the_page[the_page.find("User-Agent "):]
print s[:100] #Check our script
\end{verbatim}
\end{frame}
