talk1_webscrapping/slides.org
** Getting the response headers
   - We can use the .info() on the response object to fetch all the header received
   
   #+BEGIN_SRC python
     response.info().keys()
   #+END_SRC
* Persistence
** Persistence problem
   - HTTP was stateless in initial days
   - Bad news, now it isn't
   - Websites have login and session systems
   - HTTP states are maintained by use of headers
** Headers
   - We know how to send Headers
   - We know how to recieved headers
   - Problem solved!
** Wait, there are better ways in Python
   - urllib2 have concepts of =openers= and =handlers=
   - They allow to create, use pre-built handlers to handler case of persistence
   - We have BasicAuth managers, Cookie managers, Proxy processors
   - urllib2 does all this with help of few handlers
** Openers and Handlers
   - Till now we were using urlopen to open all URLs
   - We can make custom openers and choose specific Handlers
   - The default handler has ProxyHandler, UnknownHandler, HTTPHandler, HTTPDefaultErrorHandler, HTTPRedirectHandler, FTPHandler, FileHandler, HTTPErrorProcessor preinstalled
   - Of course you can add/remove these handlers
** Simple Example of HTTPBasicAuth
   #+BEGIN_SRC python
     # The Password Manager
     # It takes care of converting password to the default encoding (like Base64)
     password_mgr = urllib2.HTTPPasswordMgrWithDefaultRealm()
     
     # All urls nested after /foo/ will be requested with BasicAuth Headers
     top_level_url = "http://example.com/foo/"
     # Add the username and password.
     # If we knew the realm, we could use it instead of None.
     password_mgr.add_password(None, top_level_url, username, password)
     
     handler = urllib2.HTTPBasicAuthHandler(password_mgr)
     
     # create "opener" (OpenerDirector instance)
     opener = urllib2.build_opener(handler)
     
     # use the opener to fetch a URL
     opener.open("http://example.com/foo/bar.html)
     
     # Install the opener.
     # Now all calls to urllib2.urlopen use our opener.
     urllib2.install_opener(opener)
     
   #+END_SRC
** Using Handlers and Openers
   #+BEGIN_SRC text
     +--------------+    +--------------+    +----------------+
     |              |    |              |    | opener.open    |
     | Make Handler |--->| build_opener |--->|     or         |
     |              |    |              |    | install opener |
     +--------------+    +--------------+    +----------------+
     
   #+END_SRC
** Some useful opener methods
   - =opener.open=
   - =opener.add_handler=
   - =urllib2.install_opener=
   - =opener.addheaders=
** Some useful Request object methods
    - =add_data=
    - =get_method=
    - =has_data=
    - =add_headers=
    - =add_unredirected_header=
    - =has_header=

** Now let's do some login
   - To do login and maintain state, you just need to handle cookies
   - Cookies are sent in the headers
   - Manually processing header works fine
   - But *you* have to do it
   - Python can do that for you
** How Online Sessions work
   - Login in a website works simply due to persistent nature of cookies
   - When you login, server sends a Session ID in cookies.
   - Your browser stores this session ID
   - For all further requests (until you logout), the browser sends this session ID back to server
   - Web Server recognizes it to be a correct session ID and servers the page.
