talk1_webscrapping/slides.html

<div id="outline-container-8_8" class="outline-3">
<h3 id="sec-8_8"><span class="section-number-3"></span> Getting the response headers </h3>
<div class="outline-text-3" id="text-8_8">

<ul>
<li>We can use the .info() on the response object to fetch all the header received




<pre class="src src-python">response.info().keys()
</pre>


</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2"></span> Persistence </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3"></span> Persistence problem </h3>
<div class="outline-text-3" id="text-9_1">

<ul>
<li>HTTP was stateless in initial days
</li>
<li>Bad news, now it isn't
</li>
<li>Websites have login and session systems
</li>
<li>HTTP states are maintained by use of headers
</li>
</ul>

</div>

</div>

<div id="outline-container-9_2" class="outline-3">
<h3 id="sec-9_2"><span class="section-number-3"></span> Headers </h3>
<div class="outline-text-3" id="text-9_2">

<ul>
<li>We know how to send Headers
</li>
<li>We know how to recieved headers
</li>
<li>Problem solved!
</li>
</ul>

</div>

</div>

<div id="outline-container-9_3" class="outline-3">
<h3 id="sec-9_3"><span class="section-number-3"></span> Wait, there are better ways in Python </h3>
<div class="outline-text-3" id="text-9_3">

<ul>
<li>urllib2 have concepts of <code>openers</code> and <code>handlers</code>
</li>
<li>They allow to create, use pre-built handlers to handler case of persistence
</li>
<li>We have BasicAuth managers, Cookie managers, Proxy processors
</li>
<li>urllib2 does all this with help of few handlers
</li>
</ul>

</div>

</div>

<div id="outline-container-9_4" class="outline-3">
<h3 id="sec-9_4"><span class="section-number-3"></span> Openers and Handlers </h3>
<div class="outline-text-3" id="text-9_4">

<ul>
<li>Till now we were using urlopen to open all URLs
</li>
<li>We can make custom openers and choose specific Handlers
</li>
<li>The default handler has ProxyHandler, UnknownHandler, HTTPHandler, HTTPDefaultErrorHandler, HTTPRedirectHandler, FTPHandler, FileHandler, HTTPErrorProcessor preinstalled
</li>
<li>Of course you can add/remove these handlers
</li>
</ul>

</div>

</div>

<div id="outline-container-9_5" class="outline-3">
<h3 id="sec-9_5"><span class="section-number-3"></span> Simple Example of HTTPBasicAuth </h3>
<div class="outline-text-3" id="text-9_5">




<pre class="src src-python"># The Password Manager
# It takes care of converting password to the default encoding (like Base64)
<span style="color: #cdcd00;">password_mgr</span> = urllib2.HTTPPasswordMgrWithDefaultRealm()

# All urls nested after /foo/ will be requested with BasicAuth Headers
<span style="color: #cdcd00;">top_level_url</span> = <span style="color: #00cd00;">"http://example.com/foo/"</span>
# Add the username and password.
# If we knew the realm, we could use it instead of None.
password_mgr.add_password(<span style="color: #cd00cd;">None</span>, top_level_url, username, password)

<span style="color: #cdcd00;">handler</span> = urllib2.HTTPBasicAuthHandler(password_mgr)

# create "opener" (OpenerDirector instance)
<span style="color: #cdcd00;">opener</span> = urllib2.build_opener(handler)

# use the opener to fetch a URL
opener.open(<span style="color: #00cd00;">"http://example.com/foo/bar.html)

# Install the opener.
# Now all calls to urllib2.urlopen use our opener.
urllib2.install_opener(opener)

</span></pre>


</div>

</div>

<div id="outline-container-9_6" class="outline-3">
<h3 id="sec-9_6"><span class="section-number-3"></span> Using Handlers and Openers </h3>
<div class="outline-text-3" id="text-9_6">




<pre class="src src-text">+--------------+    +--------------+    +----------------+
|              |    |              |    | opener.open    |
| Make Handler |---&gt;| build_opener |---&gt;|     or         |
|              |    |              |    | install opener |
+--------------+    +--------------+    +----------------+

</pre>


</div>

</div>

<div id="outline-container-9_7" class="outline-3">
<h3 id="sec-9_7"><span class="section-number-3"></span> Some useful opener methods </h3>
<div class="outline-text-3" id="text-9_7">

<ul>
<li><code>opener.open</code>
</li>
<li><code>opener.add_handler</code>
</li>
<li><code>urllib2.install_opener</code>
</li>
<li><code>opener.addheaders</code>
</li>
</ul>

</div>

</div>

<div id="outline-container-9_8" class="outline-3">
<h3 id="sec-9_8"><span class="section-number-3"></span> Some useful Request object methods </h3>
<div class="outline-text-3" id="text-9_8">

<ul>
<li><code>add_data</code>
</li>
<li><code>get_method</code>
</li>
<li><code>has_data</code>
</li>
<li><code>add_headers</code>
</li>
<li><code>add_unredirected_header</code>
</li>
<li><code>has_header</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-9_9" class="outline-3">
<h3 id="sec-9_9"><span class="section-number-3"></span> Now let's do some login </h3>
<div class="outline-text-3" id="text-9_9">

<ul>
<li>To do login and maintain state, you just need to handle cookies
</li>
<li>Cookies are sent in the headers
</li>
<li>Manually processing header works fine
</li>
<li>But <b>you</b> have to do it
</li>
<li>Python can do that for you
</li>
</ul>

</div>

</div>

<div id="outline-container-9_10" class="outline-3">
<h3 id="sec-9_10"><span class="section-number-3"></span> How Online Sessions work </h3>
<div class="outline-text-3" id="text-9_10">

<ul>
<li>Login in a website works simply due to persistent nature of cookies
</li>
<li>When you login, server sends a Session ID in cookies.
</li>
<li>Your browser stores this session ID
</li>
<li>For all further requests (until you logout), the browser sends this session ID back to server
</li>
<li>Web Server recognizes it to be a correct session ID and servers the page.
</li>
</ul>

</div>

</div>
