talk1_webscrapping/slides.tex
\begin{frame}[fragile]
\frametitle{Getting the response headers}
\label{sec-8_8}


\begin{itemize}
\item We can use the .info() on the response object to fetch all the header received
   
\begin{verbatim}
response.info().keys()
\end{verbatim}
\end{itemize}
\end{frame}
\section{Persistence}
\label{sec-9}
\begin{frame}
\frametitle{Persistence problem}
\label{sec-9_1}


\begin{itemize}
\item HTTP was stateless in initial days
\item Bad news, now it isn't
\item Websites have login and session systems
\item HTTP states are maintained by use of headers
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Headers}
\label{sec-9_2}


\begin{itemize}
\item We know how to send Headers
\item We know how to recieved headers
\item Problem solved!
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Wait, there are better ways in Python}
\label{sec-9_3}


\begin{itemize}
\item urllib2 have concepts of \texttt{openers} and \texttt{handlers}
\item They allow to create, use pre-built handlers to handler case of persistence
\item We have BasicAuth managers, Cookie managers, Proxy processors
\item urllib2 does all this with help of few handlers
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Openers and Handlers}
\label{sec-9_4}


\begin{itemize}
\item Till now we were using urlopen to open all URLs
\item We can make custom openers and choose specific Handlers
\item The default handler has ProxyHandler, UnknownHandler, HTTPHandler, HTTPDefaultErrorHandler, HTTPRedirectHandler, FTPHandler, FileHandler, HTTPErrorProcessor preinstalled
\item Of course you can add/remove these handlers
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Simple Example of HTTPBasicAuth}
\label{sec-9_5}

\begin{verbatim}
# The Password Manager
# It takes care of converting password to the default encoding (like Base64)
password_mgr = urllib2.HTTPPasswordMgrWithDefaultRealm()

# All urls nested after /foo/ will be requested with BasicAuth Headers
top_level_url = "http://example.com/foo/"
# Add the username and password.
# If we knew the realm, we could use it instead of None.
password_mgr.add_password(None, top_level_url, username, password)

handler = urllib2.HTTPBasicAuthHandler(password_mgr)

# create "opener" (OpenerDirector instance)
opener = urllib2.build_opener(handler)

# use the opener to fetch a URL
opener.open("http://example.com/foo/bar.html)

# Install the opener.
# Now all calls to urllib2.urlopen use our opener.
urllib2.install_opener(opener)
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Using Handlers and Openers}
\label{sec-9_6}

\begin{verbatim}
+--------------+    +--------------+    +----------------+
|              |    |              |    | opener.open    |
| Make Handler |--->| build_opener |--->|     or         |
|              |    |              |    | install opener |
+--------------+    +--------------+    +----------------+
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Some useful opener methods}
\label{sec-9_7}


\begin{itemize}
\item \texttt{opener.open}
\item \texttt{opener.add\_handler}
\item \texttt{urllib2.install\_opener}
\item \texttt{opener.addheaders}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Some useful Request object methods}
\label{sec-9_8}


\begin{itemize}
\item \texttt{add\_data}
\item \texttt{get\_method}
\item \texttt{has\_data}
\item \texttt{add\_headers}
\item \texttt{add\_unredirected\_header}
\item \texttt{has\_header}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Now let's do some login}
\label{sec-9_9}


\begin{itemize}
\item To do login and maintain state, you just need to handle cookies
\item Cookies are sent in the headers
\item Manually processing header works fine
\item But \textbf{you} have to do it
\item Python can do that for you
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{How Online Sessions work}
\label{sec-9_10}


\begin{itemize}
\item Login in a website works simply due to persistent nature of cookies
\item When you login, server sends a Session ID in cookies.
\item Your browser stores this session ID
\item For all further requests (until you logout), the browser sends this session ID back to server
\item Web Server recognizes it to be a correct session ID and servers the page.
\end{itemize}
\end{frame}
