talk1_webscrapping/slides.org
** A sample session with phpinfo
      #+BEGIN_SRC python
        import urllib
        import urllib2
        
        url = 'http://localhost/~siddhant3s/phpinfo.php'
        user_agent = 'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'
        values = {'name' : 'Siddhant Sanyam',
                  'age' : '20'}
        
        headers = { 'User-Agent' : user_agent ,'Cookies':'SESSION_ID=1p2y3t4h4o5n5r6o6c7k7s'}
        
        data = urllib.urlencode(values)
        req = urllib2.Request(url, data, headers)
        response = urllib2.urlopen(req)
        the_page = response.read()
        s=the_page[the_page.find("HTTP_COOKIE"):]
        print s[:100] #Check out cookies
        
   #+END_SRC
** Example of catching cookies
   #+BEGIN_SRC python
     import urllib2
     request = urllib2.Request("http://localhost/~siddhant3s/11/")
     response=urllib2.urlopen(request)
     print response.info().keys()
     #['x-powered-by', 'transfer-encoding', 'set-cookie', 'expires', 'server',
 'connection', 'pragma'#, 'cache-control', 'date', 'content-type', 'x-xrds-location']
     
     response.info()['set-cookie']
     #'PHPSESSID=k9l406qvsblk6ju2mkkedm1qi5; path=/'
   #+END_SRC
   
** The hard way, manage cookies yourself
   - I just demonstrated catching and sending cookies
   - So the hard way was this
   - The basic flow would be like this
     #+BEGIN_SRC text
       +----------------+     +-------------------+
       |Send Request w/o|     | Recieve and store |
       | any cookies    |---->| Cookies  by server|-+
       |                |     |                   | |
       +----------------+     +-------------------+ |
       +----------------+     +-------------------+ |
       | Respect session|     | Send the cookies  | |
       |  expiry        |<----+ on next request   |<+
       |                |     |  using headers    |
       |                |     |                   |
       +----------------+     +-------------------+
       
     #+END_SRC
** The easy way, enter HTTPCookieProcessor
   - urllib2 has a handler called HTTPCookieProcessor
   - It can maintain and manage cookies between subsequent requests
   - Hence you can simulate a logged in user
** Few concepts
   - CookieJar : an object which has information about cookies
   - HTTPCookieProcessor : urllib2 Handler which handles cookies and save it to a CookieJar
   - While making request, HTTPCookieProcessor sends any cookies in CookieJar
   - While recieving a response, HTTPCookieProcessor stores cookie in the CookieJar
** Example, login in a website
   #+BEGIN_SRC python
     import urllib, urllib2, cookielib
     logindata = urllib.urlencode({'MobileNoLogin':'9876543210','LoginPassword':'45654'})
     req = urllib2.urlopen("http://fullonsms.com/home.php")
     print req.url
     req = urllib2.urlopen("http://fullonsms.com/login.php",logindata)
     req = urllib2.urlopen("http://fullonsms.com/home.php")
     print req.url
     
     #Now with cookiemanager
     cj = cookielib.CookieJar()
     cookiehandler = urllib2.HTTPCookieProcessor(cj)
     opener = urllib2.build_opener(cookiehandler)
     opener.open("http://fullonsms.com/login.php",logindata)
     req = opener.open("http://fullonsms.com/home.php")
     print req.url
     
     
     
     
   #+END_SRC
** Taking persistance to a level ahead
   - CookieJar is stored in Memory
   - We need a cookie jar which can be saved to disk
   - Advantage: no need of logging in next time
** Do it by Hand
   - Solution is simple, serialize the CookieJar
   - Save it in a file
   - Load the file
   - And unserialize it
** Do it by Python
   - =cookielib= has a persistant cookiejar
   - It tries to mimic Firefox, Thunderbird etc. in storing the cookies
   - It is called MozillaCookieJar
   - With this, you can truly be carefree about persistance 
