talk1_webscrapping/slides.html

<div id="outline-container-9_11" class="outline-3">
<h3 id="sec-9_11"><span class="section-number-3"></span> A sample session with phpinfo </h3>
<div class="outline-text-3" id="text-9_11">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib
<span style="color: #00cdcd; font-weight: bold;">import</span> urllib2

<span style="color: #cdcd00;">url</span> = <span style="color: #00cd00;">'http://localhost/~siddhant3s/phpinfo.php'</span>
<span style="color: #cdcd00;">user_agent</span> = <span style="color: #00cd00;">'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'</span>
<span style="color: #cdcd00;">values</span> = {<span style="color: #00cd00;">'name'</span> : <span style="color: #00cd00;">'Siddhant Sanyam'</span>,
          <span style="color: #00cd00;">'age'</span> : <span style="color: #00cd00;">'20'</span>}

<span style="color: #cdcd00;">headers</span> = { <span style="color: #00cd00;">'User-Agent'</span> : user_agent ,<span style="color: #00cd00;">'Cookies'</span>:<span style="color: #00cd00;">'SESSION_ID=1p2y3t4h4o5n5r6o6c7k7s'</span>}

<span style="color: #cdcd00;">data</span> = urllib.urlencode(values)
<span style="color: #cdcd00;">req</span> = urllib2.Request(url, data, headers)
<span style="color: #cdcd00;">response</span> = urllib2.urlopen(req)
<span style="color: #cdcd00;">the_page</span> = response.read()
<span style="color: #cdcd00;">s</span>=the_page[the_page.find(<span style="color: #00cd00;">"HTTP_COOKIE"</span>):]
<span style="color: #00cdcd; font-weight: bold;">print</span> s[:100] #Check out cookies

</pre>


</div>

</div>

<div id="outline-container-9_12" class="outline-3">
<h3 id="sec-9_12"><span class="section-number-3"></span> Example of catching cookies </h3>
<div class="outline-text-3" id="text-9_12">




<pre class="src src-python">    <span style="color: #00cdcd; font-weight: bold;">import</span> urllib2
    request = urllib2.Request(<span style="color: #00cd00;">"http://localhost/~siddhant3s/11/"</span>)
    response=urllib2.urlopen(request)
    <span style="color: #00cdcd; font-weight: bold;">print</span> response.info().keys()
    #['x-powered-by', 'transfer-encoding', 'set-cookie', 'expires', 'server',
<span style="color: #00cd00;">'connection'</span>, <span style="color: #00cd00;">'pragma'</span>#, 'cache-control', 'date', 'content-type', 'x-xrds-location']
    
    response.info()[<span style="color: #00cd00;">'set-cookie'</span>]
    #'PHPSESSID=k9l406qvsblk6ju2mkkedm1qi5; path=/'
</pre>



</div>

</div>

<div id="outline-container-9_13" class="outline-3">
<h3 id="sec-9_13"><span class="section-number-3"></span> The hard way, manage cookies yourself </h3>
<div class="outline-text-3" id="text-9_13">

<ul>
<li>I just demonstrated catching and sending cookies
</li>
<li>So the hard way was this
</li>
<li>The basic flow would be like this



<pre class="src src-text">+----------------+     +-------------------+
|Send Request w/o|     | Recieve and store |
| any cookies    |----&gt;| Cookies  by server|-+
|                |     |                   | |
+----------------+     +-------------------+ |
+----------------+     +-------------------+ |
| Respect session|     | Send the cookies  | |
|  expiry        |&lt;----+ on next request   |&lt;+
|                |     |  using headers    |
|                |     |                   |
+----------------+     +-------------------+

</pre>


</li>
</ul>

</div>

</div>

<div id="outline-container-9_14" class="outline-3">
<h3 id="sec-9_14"><span class="section-number-3"></span> The easy way, enter HTTPCookieProcessor </h3>
<div class="outline-text-3" id="text-9_14">

<ul>
<li>urllib2 has a handler called HTTPCookieProcessor
</li>
<li>It can maintain and manage cookies between subsequent requests
</li>
<li>Hence you can simulate a logged in user
</li>
</ul>

</div>

</div>

<div id="outline-container-9_15" class="outline-3">
<h3 id="sec-9_15"><span class="section-number-3"></span> Few concepts </h3>
<div class="outline-text-3" id="text-9_15">

<ul>
<li>CookieJar : an object which has information about cookies
</li>
<li>HTTPCookieProcessor : urllib2 Handler which handles cookies and save it to a CookieJar
</li>
<li>While making request, HTTPCookieProcessor sends any cookies in CookieJar
</li>
<li>While recieving a response, HTTPCookieProcessor stores cookie in the CookieJar
</li>
</ul>

</div>

</div>

<div id="outline-container-9_16" class="outline-3">
<h3 id="sec-9_16"><span class="section-number-3"></span> Example, login in a website </h3>
<div class="outline-text-3" id="text-9_16">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib, urllib2, cookielib
<span style="color: #cdcd00;">logindata</span> = urllib.urlencode({<span style="color: #00cd00;">'MobileNoLogin'</span>:<span style="color: #00cd00;">'9876543210'</span>,<span style="color: #00cd00;">'LoginPassword'</span>:<span style="color: #00cd00;">'45654'</span>})
<span style="color: #cdcd00;">req</span> = urllib2.urlopen(<span style="color: #00cd00;">"http://fullonsms.com/home.php"</span>)
<span style="color: #00cdcd; font-weight: bold;">print</span> req.url
<span style="color: #cdcd00;">req</span> = urllib2.urlopen(<span style="color: #00cd00;">"http://fullonsms.com/login.php"</span>,logindata)
<span style="color: #cdcd00;">req</span> = urllib2.urlopen(<span style="color: #00cd00;">"http://fullonsms.com/home.php"</span>)
<span style="color: #00cdcd; font-weight: bold;">print</span> req.url

#Now with cookiemanager
<span style="color: #cdcd00;">cj</span> = cookielib.CookieJar()
<span style="color: #cdcd00;">cookiehandler</span> = urllib2.HTTPCookieProcessor(cj)
<span style="color: #cdcd00;">opener</span> = urllib2.build_opener(cookiehandler)
opener.open(<span style="color: #00cd00;">"http://fullonsms.com/login.php"</span>,logindata)
<span style="color: #cdcd00;">req</span> = opener.open(<span style="color: #00cd00;">"http://fullonsms.com/home.php"</span>)
<span style="color: #00cdcd; font-weight: bold;">print</span> req.url




</pre>


</div>

</div>

<div id="outline-container-9_17" class="outline-3">
<h3 id="sec-9_17"><span class="section-number-3"></span> Taking persistance to a level ahead </h3>
<div class="outline-text-3" id="text-9_17">

<ul>
<li>CookieJar is stored in Memory
</li>
<li>We need a cookie jar which can be saved to disk
</li>
<li>Advantage: no need of logging in next time
</li>
</ul>

</div>

</div>

<div id="outline-container-9_18" class="outline-3">
<h3 id="sec-9_18"><span class="section-number-3"></span> Do it by Hand </h3>
<div class="outline-text-3" id="text-9_18">

<ul>
<li>Solution is simple, serialize the CookieJar
</li>
<li>Save it in a file
</li>
<li>Load the file
</li>
<li>And unserialize it
</li>
</ul>

</div>

</div>

<div id="outline-container-9_19" class="outline-3">
<h3 id="sec-9_19"><span class="section-number-3"></span> Do it by Python </h3>
<div class="outline-text-3" id="text-9_19">

<ul>
<li><code>cookielib</code> has a persistant cookiejar
</li>
<li>It tries to mimic Firefox, Thunderbird etc. in storing the cookies
</li>
<li>It is called MozillaCookieJar
</li>
<li>With this, you can truly be carefree about persistance 
</li>
</ul>

</div>

</div>
