talk1_webscrapping/slides.tex
\begin{frame}[fragile]
\frametitle{A sample session with phpinfo}
\label{sec-9_11}

\begin{verbatim}
import urllib
import urllib2

url = 'http://localhost/~siddhant3s/phpinfo.php'
user_agent = 'Mozilla/4.0 (compatible; MSIE 5.5; Windows NT)'
values = {'name' : 'Siddhant Sanyam',
          'age' : '20'}

headers = { 'User-Agent' : user_agent ,'Cookies':'SESSION_ID=1p2y3t4h4o5n5r6o6c7k7s'}

data = urllib.urlencode(values)
req = urllib2.Request(url, data, headers)
response = urllib2.urlopen(req)
the_page = response.read()
s=the_page[the_page.find("HTTP_COOKIE"):]
print s[:100] #Check out cookies
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Example of catching cookies}
\label{sec-9_12}

\begin{verbatim}
    import urllib2
    request = urllib2.Request("http://localhost/~siddhant3s/11/")
    response=urllib2.urlopen(request)
    print response.info().keys()
    #['x-powered-by', 'transfer-encoding', 'set-cookie', 'expires', 'server',
'connection', 'pragma'#, 'cache-control', 'date', 'content-type', 'x-xrds-location']
    
    response.info()['set-cookie']
    #'PHPSESSID=k9l406qvsblk6ju2mkkedm1qi5; path=/'
\end{verbatim}
   
\end{frame}
\begin{frame}[fragile]
\frametitle{The hard way, manage cookies yourself}
\label{sec-9_13}


\begin{itemize}
\item I just demonstrated catching and sending cookies
\item So the hard way was this
\item The basic flow would be like this
\begin{verbatim}
+----------------+     +-------------------+
|Send Request w/o|     | Recieve and store |
| any cookies    |---->| Cookies  by server|-+
|                |     |                   | |
+----------------+     +-------------------+ |
+----------------+     +-------------------+ |
| Respect session|     | Send the cookies  | |
|  expiry        |<----+ on next request   |<+
|                |     |  using headers    |
|                |     |                   |
+----------------+     +-------------------+
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{The easy way, enter HTTPCookieProcessor}
\label{sec-9_14}


\begin{itemize}
\item urllib2 has a handler called HTTPCookieProcessor
\item It can maintain and manage cookies between subsequent requests
\item Hence you can simulate a logged in user
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Few concepts}
\label{sec-9_15}


\begin{itemize}
\item CookieJar : an object which has information about cookies
\item HTTPCookieProcessor : urllib2 Handler which handles cookies and save it to a CookieJar
\item While making request, HTTPCookieProcessor sends any cookies in CookieJar
\item While recieving a response, HTTPCookieProcessor stores cookie in the CookieJar
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Example, login in a website}
\label{sec-9_16}

\begin{verbatim}
import urllib, urllib2, cookielib
logindata = urllib.urlencode({'MobileNoLogin':'9876543210','LoginPassword':'45654'})
req = urllib2.urlopen("http://fullonsms.com/home.php")
print req.url
req = urllib2.urlopen("http://fullonsms.com/login.php",logindata)
req = urllib2.urlopen("http://fullonsms.com/home.php")
print req.url

#Now with cookiemanager
cj = cookielib.CookieJar()
cookiehandler = urllib2.HTTPCookieProcessor(cj)
opener = urllib2.build_opener(cookiehandler)
opener.open("http://fullonsms.com/login.php",logindata)
req = opener.open("http://fullonsms.com/home.php")
print req.url
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Taking persistance to a level ahead}
\label{sec-9_17}


\begin{itemize}
\item CookieJar is stored in Memory
\item We need a cookie jar which can be saved to disk
\item Advantage: no need of logging in next time
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Do it by Hand}
\label{sec-9_18}


\begin{itemize}
\item Solution is simple, serialize the CookieJar
\item Save it in a file
\item Load the file
\item And unserialize it
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Do it by Python}
\label{sec-9_19}


\begin{itemize}
\item \texttt{cookielib} has a persistant cookiejar
\item It tries to mimic Firefox, Thunderbird etc. in storing the cookies
\item It is called MozillaCookieJar
\item With this, you can truly be carefree about persistance
\end{itemize}
\end{frame}
