talk1_webscrapping/slides.org
** The MozillaCokieJar
   - Simple to use, this is how you initialize it
   
   #+BEGIN_SRC python
     import cookielib
     jar=cookielib.MozillaCookieJar("/path/to/cookie/file")
     jar.load() #load the cookies, file must exist
     # Use your jar like you would 
     jar.save()
   #+END_SRC
** Let's take a complete example including HTTPCookieProcessor
   #+BEGIN_SRC python     
     import urllib,urllib2,cookielib
     filecookiejar = cookielib.MozillaCookieJar(os.path.expanduser('~/.sendsms.cookies'))
     try:
         filecookiejar.load()
     except:
         # File not found, make HTTPCookieProcessor w/o any initial jar
         cookieprocessor=urllib2.HTTPCookieProcessor()
     else:
         # File found, cookies loaded from file
         cookieprocessor=urllib2.HTTPCookieProcessor(filecookiejar)
         
     o = urllib2.build_opener( cookieprocessor )
     o.open("http://localhost/~siddhant3s/11")
     #some more requests
     
   #+END_SRC
** Continued.... saving cookies back to file
   #+BEGIN_SRC python
     #Now save the cookies
     cookiejar=cookieprocessor.cookiejar
     cookienum=enumerate(cookiejar).next()
     #Save all cookies
     for x in cookieenum:
         cookie = x[1]
         filecookiejar.set_cookie(cookie)
     
     #now save to file
     filecookiejar.save()
   #+END_SRC
** Now let's do some serious shit
   - There is fullonsms.com which allows sending 160char full SMSs
   - We'll try to make a utility which allows us to send message using terminal
   - Why?
     - Because it is faster, I don't need to go the website, close down popups
   - WARNING: For educational use only ;)
* Few more points
** More parsers
   - Python has a beautiful module for parsing JSON
   - Useful for the website which have JSON APIs
   - XML parser is also there, sometimes you might find it useful
   - BeautifulSoup will work most of the time, other heuristic based parsers are there
** Use correct parser
   - Most of the off-network time on of your program would be spend in parsing 
   - Choosing good parser is important
   - Please use a markup parser if the document is structured in a markup
   - Regex should be the last resort
** Nasty server checks
   - Many webservers would be anti scrappers
   - They might impose some heuristic way of checking if you are a bot
   - If that is captchas, you really can't do anythign about it
   - In most of the other cases, you can fool the webserver
   - UserAgent check is very popular webserver check
   - You may have to modify different headers in your HTTP Request
   - LiveHTTPHeader is your friend
** AJAX
   - New website have dynamic content loading with AJAX
   - Here, you have to closely observe how the AJAX call works
   - Dicipher them into simple HTTP requests
   - FireBug is your friend in this case
** Crawling
   - Avoid crawling when you can get the link at one place
   - Even if you have to use some slow parsing
   - Offline determination of new links to scrap is better than crawling
* Thank You
** Thank You
   - For any further queries you can write to me at =siddhant3s= =at= =gmail= =dot= =com=
   - I'm usually on IRC ##python at Freenode
   - Thank you for your time, thanks for listening
