talk1_webscrapping/slides.html

<div id="outline-container-9_20" class="outline-3">
<h3 id="sec-9_20"><span class="section-number-3"></span> The MozillaCokieJar </h3>
<div class="outline-text-3" id="text-9_20">

<ul>
<li>Simple to use, this is how you initialize it




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> cookielib
<span style="color: #cdcd00;">jar</span>=cookielib.MozillaCookieJar(<span style="color: #00cd00;">"/path/to/cookie/file"</span>)
jar.load() #load the cookies, file must exist
# Use your jar like you would 
jar.save()
</pre>


</li>
</ul>

</div>

</div>

<div id="outline-container-9_21" class="outline-3">
<h3 id="sec-9_21"><span class="section-number-3"></span> Let's take a complete example including HTTPCookieProcessor </h3>
<div class="outline-text-3" id="text-9_21">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">import</span> urllib,urllib2,cookielib
<span style="color: #cdcd00;">filecookiejar</span> = cookielib.MozillaCookieJar(os.path.expanduser(<span style="color: #00cd00;">'~/.sendsms.cookies'</span>))
<span style="color: #00cdcd; font-weight: bold;">try</span>:
    filecookiejar.load()
<span style="color: #00cdcd; font-weight: bold;">except</span>:
    # File not found, make HTTPCookieProcessor w/o any initial jar
    cookieprocessor=urllib2.HTTPCookieProcessor()
<span style="color: #00cdcd; font-weight: bold;">else</span>:
    # File found, cookies loaded from file
    cookieprocessor=urllib2.HTTPCookieProcessor(filecookiejar)
    
<span style="color: #cdcd00;">o</span> = urllib2.build_opener( cookieprocessor )
o.open(<span style="color: #00cd00;">"http://localhost/~siddhant3s/11"</span>)
#some more requests

</pre>


</div>

</div>

<div id="outline-container-9_22" class="outline-3">
<h3 id="sec-9_22"><span class="section-number-3"></span> Continued&hellip;. saving cookies back to file </h3>
<div class="outline-text-3" id="text-9_22">




<pre class="src src-python">#Now save the cookies
<span style="color: #cdcd00;">cookiejar</span>=cookieprocessor.cookiejar
<span style="color: #cdcd00;">cookienum</span>=<span style="color: #0000ee; font-weight: bold;">enumerate</span>(cookiejar).next()
#Save all cookies
<span style="color: #00cdcd; font-weight: bold;">for</span> x <span style="color: #00cdcd; font-weight: bold;">in</span> cookieenum:
    cookie = x[1]
    filecookiejar.set_cookie(cookie)

#now save to file
filecookiejar.save()
</pre>


</div>

</div>

<div id="outline-container-9_23" class="outline-3">
<h3 id="sec-9_23"><span class="section-number-3"></span> Now let's do some serious shit </h3>
<div class="outline-text-3" id="text-9_23">

<ul>
<li>There is fullonsms.com which allows sending 160char full SMSs
</li>
<li>We'll try to make a utility which allows us to send message using terminal
</li>
<li>Why?
<ul>
<li>Because it is faster, I don't need to go the website, close down popups
</li>
</ul>

</li>
<li>WARNING: For educational use only ;)
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2"></span> Few more points </h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10_1" class="outline-3">
<h3 id="sec-10_1"><span class="section-number-3"></span> More parsers </h3>
<div class="outline-text-3" id="text-10_1">

<ul>
<li>Python has a beautiful module for parsing JSON
</li>
<li>Useful for the website which have JSON APIs
</li>
<li>XML parser is also there, sometimes you might find it useful
</li>
<li>BeautifulSoup will work most of the time, other heuristic based parsers are there
</li>
</ul>

</div>

</div>

<div id="outline-container-10_2" class="outline-3">
<h3 id="sec-10_2"><span class="section-number-3"></span> Use correct parser </h3>
<div class="outline-text-3" id="text-10_2">

<ul>
<li>Most of the off-network time on of your program would be spend in parsing 
</li>
<li>Choosing good parser is important
</li>
<li>Please use a markup parser if the document is structured in a markup
</li>
<li>Regex should be the last resort
</li>
</ul>

</div>

</div>

<div id="outline-container-10_3" class="outline-3">
<h3 id="sec-10_3"><span class="section-number-3"></span> Nasty server checks </h3>
<div class="outline-text-3" id="text-10_3">

<ul>
<li>Many webservers would be anti scrappers
</li>
<li>They might impose some heuristic way of checking if you are a bot
</li>
<li>If that is captchas, you really can't do anythign about it
</li>
<li>In most of the other cases, you can fool the webserver
</li>
<li>UserAgent check is very popular webserver check
</li>
<li>You may have to modify different headers in your HTTP Request
</li>
<li>LiveHTTPHeader is your friend
</li>
</ul>

</div>

</div>

<div id="outline-container-10_4" class="outline-3">
<h3 id="sec-10_4"><span class="section-number-3"></span> AJAX </h3>
<div class="outline-text-3" id="text-10_4">

<ul>
<li>New website have dynamic content loading with AJAX
</li>
<li>Here, you have to closely observe how the AJAX call works
</li>
<li>Dicipher them into simple HTTP requests
</li>
<li>FireBug is your friend in this case
</li>
</ul>

</div>

</div>

<div id="outline-container-10_5" class="outline-3">
<h3 id="sec-10_5"><span class="section-number-3"></span> Crawling </h3>
<div class="outline-text-3" id="text-10_5">

<ul>
<li>Avoid crawling when you can get the link at one place
</li>
<li>Even if you have to use some slow parsing
</li>
<li>Offline determination of new links to scrap is better than crawling
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2"></span> Thank You </h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11_1" class="outline-3">
<h3 id="sec-11_1"><span class="section-number-3"></span> Thank You </h3>
<div class="outline-text-3" id="text-11_1">

<ul>
<li>For any further queries you can write to me at <code>siddhant3s</code> <code>at</code> <code>gmail</code> <code>dot</code> <code>com</code>
</li>
<li>I'm usually on IRC ##python at Freenode
</li>
<li>Thank you for your time, thanks for listening
</li>
</ul>

</div>
</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-09-03 Sat</p>
<p class="author">Author: Siddhant Sanyam</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
