talk1_webscrapping/slides.tex
\begin{frame}[fragile]
\frametitle{The MozillaCokieJar}
\label{sec-9_20}


\begin{itemize}
\item Simple to use, this is how you initialize it
   
\begin{verbatim}
import cookielib
jar=cookielib.MozillaCookieJar("/path/to/cookie/file")
jar.load() #load the cookies, file must exist
# Use your jar like you would 
jar.save()
\end{verbatim}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Let's take a complete example including HTTPCookieProcessor}
\label{sec-9_21}

\begin{verbatim}
import urllib,urllib2,cookielib
filecookiejar = cookielib.MozillaCookieJar(os.path.expanduser('~/.sendsms.cookies'))
try:
    filecookiejar.load()
except:
    # File not found, make HTTPCookieProcessor w/o any initial jar
    cookieprocessor=urllib2.HTTPCookieProcessor()
else:
    # File found, cookies loaded from file
    cookieprocessor=urllib2.HTTPCookieProcessor(filecookiejar)
    
o = urllib2.build_opener( cookieprocessor )
o.open("http://localhost/~siddhant3s/11")
#some more requests
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Continued\ldots{}. saving cookies back to file}
\label{sec-9_22}

\begin{verbatim}
#Now save the cookies
cookiejar=cookieprocessor.cookiejar
cookienum=enumerate(cookiejar).next()
#Save all cookies
for x in cookieenum:
    cookie = x[1]
    filecookiejar.set_cookie(cookie)

#now save to file
filecookiejar.save()
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Now let's do some serious shit}
\label{sec-9_23}


\begin{itemize}
\item There is fullonsms.com which allows sending 160char full SMSs
\item We'll try to make a utility which allows us to send message using terminal
\item Why?
\begin{itemize}
\item Because it is faster, I don't need to go the website, close down popups
\end{itemize}
\item WARNING: For educational use only ;)
\end{itemize}
\end{frame}
\section{Few more points}
\label{sec-10}
\begin{frame}
\frametitle{More parsers}
\label{sec-10_1}


\begin{itemize}
\item Python has a beautiful module for parsing JSON
\item Useful for the website which have JSON APIs
\item XML parser is also there, sometimes you might find it useful
\item BeautifulSoup will work most of the time, other heuristic based parsers are there
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Use correct parser}
\label{sec-10_2}


\begin{itemize}
\item Most of the off-network time on of your program would be spend in parsing
\item Choosing good parser is important
\item Please use a markup parser if the document is structured in a markup
\item Regex should be the last resort
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Nasty server checks}
\label{sec-10_3}


\begin{itemize}
\item Many webservers would be anti scrappers
\item They might impose some heuristic way of checking if you are a bot
\item If that is captchas, you really can't do anythign about it
\item In most of the other cases, you can fool the webserver
\item UserAgent check is very popular webserver check
\item You may have to modify different headers in your HTTP Request
\item LiveHTTPHeader is your friend
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{AJAX}
\label{sec-10_4}


\begin{itemize}
\item New website have dynamic content loading with AJAX
\item Here, you have to closely observe how the AJAX call works
\item Dicipher them into simple HTTP requests
\item FireBug is your friend in this case
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Crawling}
\label{sec-10_5}


\begin{itemize}
\item Avoid crawling when you can get the link at one place
\item Even if you have to use some slow parsing
\item Offline determination of new links to scrap is better than crawling
\end{itemize}
\end{frame}
\section{Thank You}
\label{sec-11}
\begin{frame}
\frametitle{Thank You}
\label{sec-11_1}


\begin{itemize}
\item For any further queries you can write to me at \texttt{siddhant3s} \texttt{at} \texttt{gmail} \texttt{dot} \texttt{com}
\item I'm usually on IRC \#\#python at Freenode
\item Thank you for your time, thanks for listening
\end{itemize}
\end{frame}

\end{document}
